app/controllers/api/comments_controller.rb

    def index
        articles = Article.find_by(id:params[:id]);
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def show
        comment = Comment.find_by(id:params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        comment = Comment.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "Hamdi"], ["body", "Body of comment"], ["article_id", 1], ["created_at", "2023-01-27 20:14:40.175735"], ["updated_at", "2023-01-27 20:14:40.175735"], ["status", "private"]]