app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save

      if params[:mon_image].present? && params[:mon_image][:image].present?
       # MonImage.create(imageable: @article, image: params[:mon_image][:image])

       @mon_image = @article.create_mon_image(image: params[:mon_image][:image])
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "..."], ["body", "..."], ["created_at", "2023-01-19 19:30:52.924669"], ["updated_at", "2023-01-19 19:30:52.924669"]]
INSERT INTO "mon_images" ("imageable_type", "imageable_id", "titre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["imageable_type", "Article"], ["imageable_id", 11], ["titre", nil], ["created_at", "2023-01-20 21:10:56.373542"], ["updated_at", "2023-01-20 21:10:56.373542"]]
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "aaaa"], ["body", "aaaaaaaaaaa"], ["created_at", "2023-01-27 05:18:53.395825"], ["updated_at", "2023-01-27 05:18:53.395825"], ["status", nil]]

  def update
    @article = Article.find(params[:id])
    if params[:mon_images_attributes].present?
      @article.mon_images.create(image: params[:mon_images_attributes][:image])
    end
    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
INSERT INTO "mon_images" ("imageable_type", "imageable_id", "titre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["imageable_type", "Article"], ["imageable_id", 9], ["titre", nil], ["created_at", "2023-01-20 17:44:33.359418"], ["updated_at", "2023-01-20 17:44:33.359418"]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "aaaaaaaaaa"], ["updated_at", "2023-01-27 16:19:51.130718"], ["id", 2]]
UPDATE "mon_images" SET "updated_at" = ? WHERE "mon_images"."id" = ?  [["updated_at", "2023-01-20 05:41:28.320049"], ["id", 9]]